wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_gpio.h
#define GPIO_CRL_CNF0_Pos               (2)
#define GPIO_CRL_CNF0                   (0x03U << GPIO_CRL_CNF0_Pos)            /*!< CNF0[1:0] bits (portx configuration bits, pin 0) */
#define GPIO_CRL_CNF0_0                 (0x01U << GPIO_CRL_CNF0_Pos)            /*!< Bit 0 */
#define GPIO_CRL_CNF0_1                 (0x02U << GPIO_CRL_CNF0_Pos)            /*!< Bit 1 */

#define GPIO_CRL_MODE1_Pos              (4)
#define GPIO_CRL_MODE1                  (0x03U << GPIO_CRL_MODE1_Pos)           /*!< MODE1[1:0] bits (portx mode bits, pin 1) */
#define GPIO_CRL_MODE1_0                (0x01U << GPIO_CRL_MODE1_Pos)           /*!< Bit 0 */
#define GPIO_CRL_MODE1_1                (0x02U << GPIO_CRL_MODE1_Pos)           /*!< Bit 1 */

#define GPIO_CRL_CNF1_Pos               (6)
#define GPIO_CRL_CNF1                   (0x03U << GPIO_CRL_CNF1_Pos)            /*!< CNF1[1:0] bits (portx configuration bits, pin 1) */
#define GPIO_CRL_CNF1_0                 (0x01U << GPIO_CRL_CNF1_Pos)            /*!< Bit 0 */
#define GPIO_CRL_CNF1_1                 (0x02U << GPIO_CRL_CNF1_Pos)            /*!< Bit 1 */

#define GPIO_CRL_MODE2_Pos              (8)
#define GPIO_CRL_MODE2                  (0x03U << GPIO_CRL_MODE2_Pos)           /*!< MODE2[1:0] bits (portx mode bits, pin 2) */
#define GPIO_CRL_MODE2_0                (0x01U << GPIO_CRL_MODE2_Pos)           /*!< Bit 0 */
#define GPIO_CRL_MODE2_1                (0x02U << GPIO_CRL_MODE2_Pos)           /*!< Bit 1 */

#define GPIO_CRL_CNF2_Pos               (10)
#define GPIO_CRL_CNF2                   (0x03U << GPIO_CRL_CNF2_Pos)            /*!< CNF2[1:0] bits (portx configuration bits, pin 2) */
#define GPIO_CRL_CNF2_0                 (0x01U << GPIO_CRL_CNF2_Pos)            /*!< Bit 0 */
#define GPIO_CRL_CNF2_1                 (0x02U << GPIO_CRL_CNF2_Pos)            /*!< Bit 1 */

#define GPIO_CRL_MODE3_Pos              (12)
#define GPIO_CRL_MODE3                  (0x03U << GPIO_CRL_MODE3_Pos)           /*!< MODE3[1:0] bits (portx mode bits, pin 3) */
#define GPIO_CRL_MODE3_0                (0x01U << GPIO_CRL_MODE3_Pos)           /*!< Bit 0 */
#define GPIO_CRL_MODE3_1                (0x02U << GPIO_CRL_MODE3_Pos)           /*!< Bit 1 */

#define GPIO_CRL_CNF3_Pos               (14)
#define GPIO_CRL_CNF3                   (0x03U << GPIO_CRL_CNF3_Pos)            /*!< CNF3[1:0] bits (portx configuration bits, pin 3) */
#define GPIO_CRL_CNF3_0                 (0x01U << GPIO_CRL_CNF3_Pos)            /*!< Bit 0 */
#define GPIO_CRL_CNF3_1                 (0x02U << GPIO_CRL_CNF3_Pos)            /*!< Bit 1 */

#define GPIO_CRL_MODE4_Pos              (16)
#define GPIO_CRL_MODE4                  (0x03U << GPIO_CRL_MODE4_Pos)           /*!< MODE4[1:0] bits (portx mode bits, pin 4) */
#define GPIO_CRL_MODE4_0                (0x01U << GPIO_CRL_MODE4_Pos)           /*!< Bit 0 */
#define GPIO_CRL_MODE4_1                (0x02U << GPIO_CRL_MODE4_Pos)           /*!< Bit 1 */

#define GPIO_CRL_CNF4_Pos               (18)
#define GPIO_CRL_CNF4                   (0x03U << GPIO_CRL_CNF4_Pos)            /*!< CNF4[1:0] bits (portx configuration bits, pin 4) */
#define GPIO_CRL_CNF4_0                 (0x01U << GPIO_CRL_CNF4_Pos)            /*!< Bit 0 */
#define GPIO_CRL_CNF4_1                 (0x02U << GPIO_CRL_CNF4_Pos)            /*!< Bit 1 */

#define GPIO_CRL_MODE5_Pos              (20)
#define GPIO_CRL_MODE5                  (0x03U << GPIO_CRL_MODE5_Pos)           /*!< MODE5[1:0] bits (portx mode bits, pin 5) */
#define GPIO_CRL_MODE5_0                (0x01U << GPIO_CRL_MODE5_Pos)           /*!< Bit 0 */
#define GPIO_CRL_MODE5_1                (0x02U << GPIO_CRL_MODE5_Pos)           /*!< Bit 1 */

#define GPIO_CRL_CNF5_Pos               (22)
#define GPIO_CRL_CNF5                   (0x03U << GPIO_CRL_CNF5_Pos)            /*!< CNF5[1:0] bits (portx configuration bits, pin 5) */
#define GPIO_CRL_CNF5_0                 (0x01U << GPIO_CRL_CNF5_Pos)            /*!< Bit 0 */
#define GPIO_CRL_CNF5_1                 (0x02U << GPIO_CRL_CNF5_Pos)            /*!< Bit 1 */

#define GPIO_CRL_MODE6_Pos              (24)
#define GPIO_CRL_MODE6                  (0x03U << GPIO_CRL_MODE6_Pos)           /*!< MODE6[1:0] bits (portx mode bits, pin 6) */
#define GPIO_CRL_MODE6_0                (0x01U << GPIO_CRL_MODE6_Pos)           /*!< Bit 0 */
#define GPIO_CRL_MODE6_1                (0x02U << GPIO_CRL_MODE6_Pos)           /*!< Bit 1 */

#define GPIO_CRL_CNF6_Pos               (26)
#define GPIO_CRL_CNF6                   (0x03U << GPIO_CRL_CNF6_Pos)            /*!< CNF6[1:0] bits (portx configuration bits, pin 6) */
#define GPIO_CRL_CNF6_0                 (0x01U << GPIO_CRL_CNF6_Pos)            /*!< Bit 0 */
#define GPIO_CRL_CNF6_1                 (0x02U << GPIO_CRL_CNF6_Pos)            /*!< Bit 1 */

#define GPIO_CRL_MODE7_Pos              (28)
#define GPIO_CRL_MODE7                  (0x03U << GPIO_CRL_MODE7_Pos)           /*!< MODE7[1:0] bits (portx mode bits, pin 7) */
#define GPIO_CRL_MODE7_0                (0x01U << GPIO_CRL_MODE7_Pos)           /*!< Bit 0 */
#define GPIO_CRL_MODE7_1                (0x02U << GPIO_CRL_MODE7_Pos)           /*!< Bit 1 */

#define GPIO_CRL_CNF7_Pos               (30)
#define GPIO_CRL_CNF7                   (0x03U << GPIO_CRL_CNF7_Pos)            /*!< CNF7[1:0] bits (portx configuration bits, pin 7) */
#define GPIO_CRL_CNF7_0                 (0x01U << GPIO_CRL_CNF7_Pos)            /*!< Bit 0 */
#define GPIO_CRL_CNF7_1                 (0x02U << GPIO_CRL_CNF7_Pos)            /*!< Bit 1 */

/**
  * @brief GPIO_CRH Register Bit Definition
  */
#define GPIO_CRH_MODE                   ((uint32_t)0x33333333)                  /*!< Port x mode bits */

#define GPIO_CRH_MODE8_Pos              (0)
#define GPIO_CRH_MODE8                  (0x03U << GPIO_CRH_MODE8_Pos)           /*!< MODE8[1:0] bits (portx mode bits, pin 0) */
#define GPIO_CRH_MODE8_0                (0x01U << GPIO_CRH_MODE8_Pos)           /*!< Bit 0 */
#define GPIO_CRH_MODE8_1                (0x02U << GPIO_CRH_MODE8_Pos)           /*!< Bit 1 */
#define GPIO_CRH_CNF8_Pos               (2)
#define GPIO_CRH_CNF8                   (0x03U << GPIO_CRH_CNF8_Pos)            /*!< CNF8[1:0] bits (portx configuration bits, pin 0) */
#define GPIO_CRH_CNF8_0                 (0x01U << GPIO_CRH_CNF8_Pos)            /*!< Bit 0 */
#define GPIO_CRH_CNF8_1                 (0x02U << GPIO_CRH_CNF8_Pos)            /*!< Bit 1 */
#define GPIO_CRH_MODE9_Pos              (4)
#define GPIO_CRH_MODE9                  (0x03U << GPIO_CRH_MODE9_Pos)           /*!< MODE9[1:0] bits (portx mode bits, pin 1) */
#define GPIO_CRH_MODE9_0                (0x01U << GPIO_CRH_MODE9_Pos)           /*!< Bit 0 */
#define GPIO_CRH_MODE9_1                (0x02U << GPIO_CRH_MODE9_Pos)           /*!< Bit 1 */
#define GPIO_CRH_CNF9_Pos               (6)
#define GPIO_CRH_CNF9                   (0x03U << GPIO_CRH_CNF9_Pos)            /*!< CNF9[1:0] bits (portx configuration bits, pin 1) */
#define GPIO_CRH_CNF9_0                 (0x01U << GPIO_CRH_CNF9_Pos)            /*!< Bit 0 */
#define GPIO_CRH_CNF9_1                 (0x02U << GPIO_CRH_CNF9_Pos)            /*!< Bit 1 */
#define GPIO_CRH_MODE10_Pos             (8)
#define GPIO_CRH_MODE10                 (0x03U << GPIO_CRH_MODE10_Pos)          /*!< MODE10[1:0] bits (portx mode bits, pin 2) */
#define GPIO_CRH_MODE10_0               (0x01U << GPIO_CRH_MODE10_Pos)          /*!< Bit 0 */
#define GPIO_CRH_MODE10_1               (0x02U << GPIO_CRH_MODE10_Pos)          /*!< Bit 1 */
#define GPIO_CRH_CNF10_Pos              (10)
#define GPIO_CRH_CNF10                  (0x03U << GPIO_CRH_CNF10_Pos)           /*!< CNF10[1:0] bits (portx configuration bits, pin 2) */
#define GPIO_CRH_CNF10_0                (0x01U << GPIO_CRH_CNF10_Pos)           /*!< Bit 0 */
#define GPIO_CRH_CNF10_1                (0x02U << GPIO_CRH_CNF10_Pos)           /*!< Bit 1 */
#define GPIO_CRH_MODE11_Pos             (12)
#define GPIO_CRH_MODE11                 (0x03U << GPIO_CRH_MODE11_Pos)          /*!< MODE11[1:0] bits (portx mode bits, pin 3) */
#define GPIO_CRH_MODE11_0               (0x01U << GPIO_CRH_MODE11_Pos)          /*!< Bit 0 */
#define GPIO_CRH_MODE11_1               (0x02U << GPIO_CRH_MODE11_Pos)          /*!< Bit 1 */
#define GPIO_CRH_CNF11_Pos              (14)
#define GPIO_CRH_CNF11                  (0x03U << GPIO_CRH_CNF11_Pos)           /*!< CNF11[1:0] bits (portx configuration bits, pin 3) */
#define GPIO_CRH_CNF11_0                (0x01U << GPIO_CRH_CNF11_Pos)           /*!< Bit 0 */
#define GPIO_CRH_CNF11_1                (0x02U << GPIO_CRH_CNF11_Pos)           /*!< Bit 1 */
#define GPIO_CRH_MODE12_Pos             (16)
#define GPIO_CRH_MODE12                 (0x03U << GPIO_CRH_MODE12_Pos)          /*!< MODE12[1:0] bits (portx mode bits, pin 4) */
#define GPIO_CRH_MODE12_0               (0x01U << GPIO_CRH_MODE12_Pos)          /*!< Bit 0 */
#define GPIO_CRH_MODE12_1               (0x02U << GPIO_CRH_MODE12_Pos)          /*!< Bit 1 */
#define GPIO_CRH_CNF12_Pos              (18)
#define GPIO_CRH_CNF12                  (0x03U << GPIO_CRH_CNF12_Pos)           /*!< CNF12[1:0] bits (portx configuration bits, pin 4) */
#define GPIO_CRH_CNF12_0                (0x01U << GPIO_CRH_CNF12_Pos)           /*!< Bit 0 */
#define GPIO_CRH_CNF12_1                (0x02U << GPIO_CRH_CNF12_Pos)           /*!< Bit 1 */
#define GPIO_CRH_MODE13_Pos             (20)
#define GPIO_CRH_MODE13                 (0x03U << GPIO_CRH_MODE13_Pos)          /*!< MODE13[1:0] bits (portx mode bits, pin 5) */
#define GPIO_CRH_MODE13_0               (0x01U << GPIO_CRH_MODE13_Pos)          /*!< Bit 0 */
#define GPIO_CRH_MODE13_1               (0x02U << GPIO_CRH_MODE13_Pos)          /*!< Bit 1 */
#define GPIO_CRH_CNF13_Pos              (22)
#define GPIO_CRH_CNF13                  (0x03U << GPIO_CRH_CNF13_Pos)           /*!< CNF13[1:0] bits (portx configuration bits, pin 5) */
#define GPIO_CRH_CNF13_0                (0x01U << GPIO_CRH_CNF13_Pos)           /*!< Bit 0 */
#define GPIO_CRH_CNF13_1                (0x02U << GPIO_CRH_CNF13_Pos)           /*!< Bit 1 */
#define GPIO_CRH_MODE14_Pos             (24)
#define GPIO_CRH_MODE14                 (0x03U << GPIO_CRH_MODE14_Pos)          /*!< MODE14[1:0] bits (portx mode bits, pin 6) */
#define GPIO_CRH_MODE14_0               (0x01U << GPIO_CRH_MODE14_Pos)          /*!< Bit 0 */
#define GPIO_CRH_MODE14_1               (0x02U << GPIO_CRH_MODE14_Pos)          /*!< Bit 1 */
#define GPIO_CRH_CNF14_Pos              (26)
#define GPIO_CRH_CNF14                  (0x03U << GPIO_CRH_CNF14_Pos)           /*!< CNF14[1:0] bits (portx configuration bits, pin 6) */
#define GPIO_CRH_CNF14_0                (0x01U << GPIO_CRH_CNF14_Pos)           /*!< Bit 0 */
#define GPIO_CRH_CNF14_1                (0x02U << GPIO_CRH_CNF14_Pos)           /*!< Bit 1 */
#define GPIO_CRH_MODE15_Pos             (28)
#define GPIO_CRH_MODE15                 (0x03U << GPIO_CRH_MODE15_Pos)          /*!< MODE15[1:0] bits (portx mode bits, pin 7) */
#define GPIO_CRH_MODE15_0               (0x01U << GPIO_CRH_MODE15_Pos)          /*!< Bit 0 */
#define GPIO_CRH_MODE15_1               (0x02U << GPIO_CRH_MODE15_Pos)          /*!< Bit 1 */
#define GPIO_CRH_CNF15_Pos              (30)
#define GPIO_CRH_CNF15                  (0x03U << GPIO_CRH_CNF15_Pos)           /*!< CNF15[1:0] bits (portx configuration bits, pin 7) */
#define GPIO_CRH_CNF15_0                (0x01U << GPIO_CRH_CNF15_Pos)           /*!< Bit 0 */
#define GPIO_CRH_CNF15_1                (0x02U << GPIO_CRH_CNF15_Pos)           /*!< Bit 1 */

/**
  * @brief GPIO_IDR Register Bit Definition
  */
#define GPIO_IDR_Pos                    (0)
#define GPIO_IDR                        (0xFFFFU << GPIO_IDR_DATA_Pos)          /*!< Port input data */

/**
  * @brief GPIO_IDR Register Bit Definition
  */
#define GPIO_IDR_IDR0_Pos               (0)
#define GPIO_IDR_IDR0                   (0x01U << GPIO_IDR_IDR0_Pos)            /*!< Portx Set bit 0 */
#define GPIO_IDR_IDR1_Pos               (1)
#define GPIO_IDR_IDR1                   (0x01U << GPIO_IDR_IDR1_Pos)            /*!< Portx Set bit 1 */
#define GPIO_IDR_IDR2_Pos               (2)
#define GPIO_IDR_IDR2                   (0x01U << GPIO_IDR_IDR2_Pos)            /*!< Portx Set bit 2 */
#define GPIO_IDR_IDR3_Pos               (3)
#define GPIO_IDR_IDR3                   (0x01U << GPIO_IDR_IDR3_Pos)            /*!< Portx Set bit 3 */
#define GPIO_IDR_IDR4_Pos               (4)
#define GPIO_IDR_IDR4                   (0x01U << GPIO_IDR_IDR4_Pos)            /*!< Portx Set bit 4 */
#define GPIO_IDR_IDR5_Pos               (5)
#define GPIO_IDR_IDR5                   (0x01U << GPIO_IDR_IDR5_Pos)            /*!< Portx Set bit 5 */
#define GPIO_IDR_IDR6_Pos               (6)
#define GPIO_IDR_IDR6                   (0x01U << GPIO_IDR_IDR6_Pos)            /*!< Portx Set bit 6 */
#define GPIO_IDR_IDR7_Pos               (7)
#define GPIO_IDR_IDR7                   (0x01U << GPIO_IDR_IDR7_Pos)            /*!< Portx Set bit 7 */
#define GPIO_IDR_IDR8_Pos               (8)
#define GPIO_IDR_IDR8                   (0x01U << GPIO_IDR_IDR8_Pos)            /*!< Portx Set bit 8 */
#define GPIO_IDR_IDR9_Pos               (9)
#define GPIO_IDR_IDR9                   (0x01U << GPIO_IDR_IDR9_Pos)            /*!< Portx Set bit 9 */
#define GPIO_IDR_IDR10_Pos              (10)
#define GPIO_IDR_IDR10                  (0x01U << GPIO_IDR_IDR10_Pos)           /*!< Portx Set bit 10 */
#define GPIO_IDR_IDR11_Pos              (11)
#define GPIO_IDR_IDR11                  (0x01U << GPIO_IDR_IDR11_Pos)           /*!< Portx Set bit 11 */
#define GPIO_IDR_IDR12_Pos              (12)
#define GPIO_IDR_IDR12                  (0x01U << GPIO_IDR_IDR12_Pos)           /*!< Portx Set bit 12 */
#define GPIO_IDR_IDR13_Pos              (13)
#define GPIO_IDR_IDR13                  (0x01U << GPIO_IDR_IDR13_Pos)           /*!< Portx Set bit 13 */
#define GPIO_IDR_IDR14_Pos              (14)
#define GPIO_IDR_IDR14                  (0x01U << GPIO_IDR_IDR14_Pos)           /*!< Portx Set bit 14 */
#define GPIO_IDR_IDR15_Pos              (15)
#define GPIO_IDR_IDR15                  (0x01U << GPIO_IDR_IDR15_Pos)           /*!< Portx Set bit 15 */

/**
  * @brief GPIO_ODR Register Bit Definition
  */
#define GPIO_ODR_DATA_Pos               (0)
#define GPIO_ODR_DATA                   (0xFFFF << GPIO_ODR_DATA_Pos)           /*!< Port output data */

/**
  * @brief GPIO_ODR Register Bit Definition
  */
#define GPIO_ODR_ODR0_Pos               (0)
#define GPIO_ODR_ODR0                   (0x01U << GPIO_ODR_ODR0_Pos)            /*!< Portx Set bit 0 */
#define GPIO_ODR_ODR1_Pos               (1)
#define GPIO_ODR_ODR1                   (0x01U << GPIO_ODR_ODR1_Pos)            /*!< Portx Set bit 1 */
#define GPIO_ODR_ODR2_Pos               (2)
#define GPIO_ODR_ODR2                   (0x01U << GPIO_ODR_ODR2_Pos)            /*!< Portx Set bit 2 */
#define GPIO_ODR_ODR3_Pos               (3)
#define GPIO_ODR_ODR3                   (0x01U << GPIO_ODR_ODR3_Pos)            /*!< Portx Set bit 3 */
#define GPIO_ODR_ODR4_Pos               (4)
#define GPIO_ODR_ODR4                   (0x01U << GPIO_ODR_ODR4_Pos)            /*!< Portx Set bit 4 */
#define GPIO_ODR_ODR5_Pos               (5)
#define GPIO_ODR_ODR5                   (0x01U << GPIO_ODR_ODR5_Pos)            /*!< Portx Set bit 5 */
#define GPIO_ODR_ODR6_Pos               (6)
#define GPIO_ODR_ODR6                   (0x01U << GPIO_ODR_ODR6_Pos)            /*!< Portx Set bit 6 */
#define GPIO_ODR_ODR7_Pos               (7)
#define GPIO_ODR_ODR7                   (0x01U << GPIO_ODR_ODR7_Pos)            /*!< Portx Set bit 7 */
#define GPIO_ODR_ODR8_Pos               (8)
#define GPIO_ODR_ODR8                   (0x01U << GPIO_ODR_ODR8_Pos)            /*!< Portx Set bit 8 */
#define GPIO_ODR_ODR9_Pos               (9)
#define GPIO_ODR_ODR9                   (0x01U << GPIO_ODR_ODR9_Pos)            /*!< Portx Set bit 9 */
#define GPIO_ODR_ODR10_Pos              (10)
#define GPIO_ODR_ODR10                  (0x01U << GPIO_ODR_ODR10_Pos)           /*!< Portx Set bit 10 */
#define GPIO_ODR_ODR11_Pos              (11)
#define GPIO_ODR_ODR11                  (0x01U << GPIO_ODR_ODR11_Pos)           /*!< Portx Set bit 11 */
#define GPIO_ODR_ODR12_Pos              (12)
#define GPIO_ODR_ODR12                  (0x01U << GPIO_ODR_ODR12_Pos)           /*!< Portx Set bit 12 */
#define GPIO_ODR_ODR13_Pos              (13)
#define GPIO_ODR_ODR13                  (0x01U << GPIO_ODR_ODR13_Pos)           /*!< Portx Set bit 13 */
#define GPIO_ODR_ODR14_Pos              (14)
#define GPIO_ODR_ODR14                  (0x01U << GPIO_ODR_ODR14_Pos)           /*!< Portx Set bit 14 */
#define GPIO_ODR_ODR15_Pos              (15)
#define GPIO_ODR_ODR15                  (0x01U << GPIO_ODR_ODR15_Pos)           /*!< Portx Set bit 15 */

/**
  * @brief GPIO_BRR Register Bit Definition
  */
#define GPIO_BSRR_BS_Pos                (0)
#define GPIO_BSRR_BS                    (0xFFFFU << GPIO_BSRR_BS_Pos)           /*!< Portx Reset */

/**
  * @brief GPIO_BSRR Register Bit Definition
  */
#define GPIO_BSRR_BS0_Pos               (0)
#define GPIO_BSRR_BS0                   (0x01U << GPIO_BSRR_BS0_Pos)            /*!< Portx Set bit 0 */
#define GPIO_BSRR_BS1_Pos               (1)
#define GPIO_BSRR_BS1                   (0x01U << GPIO_BSRR_BS1_Pos)            /*!< Portx Set bit 1 */
#define GPIO_BSRR_BS2_Pos               (2)
#define GPIO_BSRR_BS2                   (0x01U << GPIO_BSRR_BS2_Pos)            /*!< Portx Set bit 2 */
#define GPIO_BSRR_BS3_Pos               (3)
#define GPIO_BSRR_BS3                   (0x01U << GPIO_BSRR_BS3_Pos)            /*!< Portx Set bit 3 */
#define GPIO_BSRR_BS4_Pos               (4)
#define GPIO_BSRR_BS4                   (0x01U << GPIO_BSRR_BS4_Pos)            /*!< Portx Set bit 4 */
#define GPIO_BSRR_BS5_Pos               (5)
#define GPIO_BSRR_BS5                   (0x01U << GPIO_BSRR_BS5_Pos)            /*!< Portx Set bit 5 */
#define GPIO_BSRR_BS6_Pos               (6)
#define GPIO_BSRR_BS6                   (0x01U << GPIO_BSRR_BS6_Pos)            /*!< Portx Set bit 6 */
#define GPIO_BSRR_BS7_Pos               (7)
#define GPIO_BSRR_BS7                   (0x01U << GPIO_BSRR_BS7_Pos)            /*!< Portx Set bit 7 */
#define GPIO_BSRR_BS8_Pos               (8)
#define GPIO_BSRR_BS8                   (0x01U << GPIO_BSRR_BS8_Pos)            /*!< Portx Set bit 8 */
#define GPIO_BSRR_BS9_Pos               (9)
#define GPIO_BSRR_BS9                   (0x01U << GPIO_BSRR_BS9_Pos)            /*!< Portx Set bit 9 */
#define GPIO_BSRR_BS10_Pos              (10)
#define GPIO_BSRR_BS10                  (0x01U << GPIO_BSRR_BS10_Pos)           /*!< Portx Set bit 10 */
#define GPIO_BSRR_BS11_Pos              (11)
#define GPIO_BSRR_BS11                  (0x01U << GPIO_BSRR_BS11_Pos)           /*!< Portx Set bit 11 */
#define GPIO_BSRR_BS12_Pos              (12)
#define GPIO_BSRR_BS12                  (0x01U << GPIO_BSRR_BS12_Pos)           /*!< Portx Set bit 12 */
#define GPIO_BSRR_BS13_Pos              (13)
#define GPIO_BSRR_BS13                  (0x01U << GPIO_BSRR_BS13_Pos)           /*!< Portx Set bit 13 */
#define GPIO_BSRR_BS14_Pos              (14)
#define GPIO_BSRR_BS14                  (0x01U << GPIO_BSRR_BS14_Pos)           /*!< Portx Set bit 14 */
#define GPIO_BSRR_BS15_Pos              (15)
#define GPIO_BSRR_BS15                  (0x01U << GPIO_BSRR_BS15_Pos)           /*!< Portx Set bit 15 */

#define GPIO_BSRR_BR0_Pos               (16)
#define GPIO_BSRR_BR0                   (0x01U << GPIO_BSRR_BR0_Pos)            /*!< Portx Reset bit 0 */
#define GPIO_BSRR_BR1_Pos               (17)
#define GPIO_BSRR_BR1                   (0x01U << GPIO_BSRR_BR1_Pos)            /*!< Portx Reset bit 1 */
#define GPIO_BSRR_BR2_Pos               (18)
#define GPIO_BSRR_BR2                   (0x01U << GPIO_BSRR_BR2_Pos)            /*!< Portx Reset bit 2 */
#define GPIO_BSRR_BR3_Pos               (19)
#define GPIO_BSRR_BR3                   (0x01U << GPIO_BSRR_BR3_Pos)            /*!< Portx Reset bit 3 */
#define GPIO_BSRR_BR4_Pos               (20)
#define GPIO_BSRR_BR4                   (0x01U << GPIO_BSRR_BR4_Pos)            /*!< Portx Reset bit 4 */
#define GPIO_BSRR_BR5_Pos               (21)
#define GPIO_BSRR_BR5                   (0x01U << GPIO_BSRR_BR5_Pos)            /*!< Portx Reset bit 5 */
#define GPIO_BSRR_BR6_Pos               (22)
#define GPIO_BSRR_BR6                   (0x01U << GPIO_BSRR_BR6_Pos)            /*!< Portx Reset bit 6 */
#define GPIO_BSRR_BR7_Pos               (23)
#define GPIO_BSRR_BR7                   (0x01U << GPIO_BSRR_BR7_Pos)            /*!< Portx Reset bit 7 */
#define GPIO_BSRR_BR8_Pos               (24)
#define GPIO_BSRR_BR8                   (0x01U << GPIO_BSRR_BR8_Pos)            /*!< Portx Reset bit 8 */
#define GPIO_BSRR_BR9_Pos               (25)
#define GPIO_BSRR_BR9                   (0x01U << GPIO_BSRR_BR9_Pos)            /*!< Portx Reset bit 9 */
#define GPIO_BSRR_BR10_Pos              (26)
#define GPIO_BSRR_BR10                  (0x01U << GPIO_BSRR_BR10_Pos)           /*!< Portx Reset bit 10 */
#define GPIO_BSRR_BR11_Pos              (27)
#define GPIO_BSRR_BR11                  (0x01U << GPIO_BSRR_BR11_Pos)           /*!< Portx Reset bit 11 */
#define GPIO_BSRR_BR12_Pos              (28)
#define GPIO_BSRR_BR12                  (0x01U << GPIO_BSRR_BR12_Pos)           /*!< Portx Reset bit 12 */
#define GPIO_BSRR_BR13_Pos              (29)
#define GPIO_BSRR_BR13                  (0x01U << GPIO_BSRR_BR13_Pos)           /*!< Portx Reset bit 13 */
#define GPIO_BSRR_BR14_Pos              (30)
#define GPIO_BSRR_BR14                  (0x01U << GPIO_BSRR_BR14_Pos)           /*!< Portx Reset bit 14 */
#define GPIO_BSRR_BR15_Pos              (31)
#define GPIO_BSRR_BR15                  (0x01U << GPIO_BSRR_BR15_Pos)           /*!< Portx Reset bit 15 */

/**
  * @brief GPIO_BRR Register Bit Definition
  */
#define GPIO_BRR_BR_Pos                 (0)
#define GPIO_BRR_BR                     (0xFFFFU << GPIO_BRR_BR_Pos)            /*!< Portx Reset */

